public/sapico/ZE_Revenue_AGNPB-20251102.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Header/>
  <soapenv:Body>
    <dws:setTransaction xmlns:dws="http://dwssync_pfi_qa" xmlns:xsd="http://dwssync_pfi_qa/xsd">
      <dws:input>
        <xsd:ITEM>
          <xsd:AUFNR></xsd:AUFNR>
          <xsd:BUKRS>4000</xsd:BUKRS>
          <xsd:BLDAT>20251102</xsd:BLDAT>
          <xsd:BUDAT>20251102</xsd:BUDAT>
          <xsd:MONAT>11</xsd:MONAT>
          <xsd:BLART>ZE</xsd:BLART>
          <xsd:WAERS>IDR</xsd:WAERS>
          <xsd:XBLNR>29111</xsd:XBLNR>
          <xsd:BKTXT>ZE20251102-- REV3 --</xsd:BKTXT>
          <xsd:BSCHL>01</xsd:BSCHL>
          <xsd:NEWKO>5000000000</xsd:NEWKO>
          <xsd:WRBTR>98208344</xsd:WRBTR>
          <xsd:GSBER>HO00</xsd:GSBER>
          <xsd:ZFBDT>20251102</xsd:ZFBDT>
          <xsd:ZTERM>Z030</xsd:ZTERM>
          <xsd:PRCTR>PFI0040005</xsd:PRCTR>
          <xsd:ZUONR>REVENUE-AGNPK</xsd:ZUONR>  <!-- ✅ Changed to AGNPK -->
          <xsd:KOSTL></xsd:KOSTL>
          <xsd:WWPRD></xsd:WWPRD>
          <xsd:KUNNR>5000000000</xsd:KUNNR>
          <xsd:SGTXT>POSPAY AGEN</xsd:SGTXT>
          <xsd:STATE></xsd:STATE>
        </xsd:ITEM>
        <xsd:ITEM>
          <xsd:AUFNR></xsd:AUFNR>
          <xsd:BUKRS>4000</xsd:BUKRS>
          <xsd:BLDAT>20251102</xsd:BLDAT>
          <xsd:BUDAT>20251102</xsd:BUDAT>
          <xsd:MONAT>11</xsd:MONAT>
          <xsd:BLART>ZE</xsd:BLART>
          <xsd:WAERS>IDR</xsd:WAERS>
          <xsd:XBLNR>29111</xsd:XBLNR>
          <xsd:BKTXT>ZE20251102-- REV3 --</xsd:BKTXT>
          <xsd:BSCHL>50</xsd:BSCHL>
          <xsd:NEWKO>4200210000</xsd:NEWKO>  <!-- ✅ Changed from 4100210000 to 4200210000 -->
          <xsd:WRBTR>98208344</xsd:WRBTR>
          <xsd:GSBER>HO00</xsd:GSBER>
          <xsd:ZFBDT>20251102</xsd:ZFBDT>
          <xsd:ZTERM>Z030</xsd:ZTERM>
          <xsd:PRCTR>PFI0040005</xsd:PRCTR>
          <xsd:ZUONR>REVENUE-AGNPK</xsd:ZUONR>  <!-- ✅ Changed to AGNPK -->
          <xsd:KOSTL></xsd:KOSTL>
          <xsd:WWPRD>12100111</xsd:WWPRD>
          <xsd:KUNNR></xsd:KUNNR>
          <xsd:SGTXT>POSPAY AGEN</xsd:SGTXT>
          <xsd:STATE></xsd:STATE>
        </xsd:ITEM>
      </dws:input>
      <dws:type>JSON</dws:type>
    </dws:setTransaction>
  </soapenv:Body>
</soapenv:Envelope>